In [1]:
import mysql.connector
import pandas as pd

# Establishing the connection
try:
    conn = mysql.connector.connect(
        host='localhost',        # e.g., 'localhost' or your server address
        user='root',        # your MySQL username
        password='admin',# your MySQL password
        database='Mysql_learners' # the name of your database
    )

    if conn.is_connected():
        print("Database connection established")
    
except mysql.connector.Error as e:
    print(f"Error connecting to database: {e}")

Database connection established

# Load sql magic module

In [2]:
%load_ext sql

In [4]:
!pip install ipython-sql prettytable

import prettytable

prettytable.DEFAULT = 'DEFAULT'

Requirement already satisfied: ipython-sql in c:\users\softp\appdata\local\programs\python\python311\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in c:\users\softp\appdata\local\programs\python\python311\lib\site-packages (3.16.0)
Requirement already satisfied: ipython in c:\users\softp\appdata\roaming\python\python311\site-packages (from ipython-sql) (8.32.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\softp\appdata\roaming\python\python311\site-packages (from ipython-sql) (2.0.40)
Requirement already satisfied: sqlparse in c:\users\softp\appdata\local\programs\python\python311\lib\site-packages (from ipython-sql) (0.5.3)
Requirement already satisfied: six in c:\users\softp\appdata\local\programs\python\python311\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\users\softp\appdata\local\programs\python\python311\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: wcwidth in c:\users\softp\appdata\roaming\python\python311\site-packages (from prettytable) (0.2.13)
Requirement already satisfied: greenlet>=1 in c:\users\softp\appdata\roaming\python\python311\site-packages (from sqlalchemy>=2.0->ipython-sql) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\softp\appdata\roaming\python\python311\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: colorama in c:\users\softp\appdata\roaming\python\python311\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: decorator in c:\users\softp\appdata\roaming\python\python311\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\softp\appdata\roaming\python\python311\site-packages (from ipython->ipython-sql) (0.19.2)
Requirement already satisfied: matplotlib-inline in c:\users\softp\appdata\roaming\python\python311\site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: prompt_toolkit<3.1.0,>=3.0.41 in c:\users\softp\appdata\roaming\python\python311\site-packages (from ipython->ipython-sql) (3.0.50)
Requirement already satisfied: pygments>=2.4.0 in c:\users\softp\appdata\roaming\python\python311\site-packages (from ipython->ipython-sql) (2.19.1)
Requirement already satisfied: stack_data in c:\users\softp\appdata\roaming\python\python311\site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\softp\appdata\roaming\python\python311\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in c:\users\softp\appdata\roaming\python\python311\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: executing>=1.2.0 in c:\users\softp\appdata\roaming\python\python311\site-packages (from stack_data->ipython->ipython-sql) (2.2.0)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\softp\appdata\roaming\python\python311\site-packages (from stack_data->ipython->ipython-sql) (3.0.0)
Requirement already satisfied: pure-eval in c:\users\softp\appdata\roaming\python\python311\site-packages (from stack_data->ipython->ipython-sql) (0.2.3)

In [5]:
# Reading data from a table into a Pandas DataFrame
try:
    query = "SELECT * FROM chicago_socioeconomic_data"  # Replace with your table name
    df = pd.read_sql(query, conn)
    print("Data read successfully into DataFrame")
    print(df.head())  # To display the first few rows of the DataFrame

except mysql.connector.Error as e:
    print(f"Error reading data from table: {e}")

Data read successfully into DataFrame
  COMMUNITY_AREA_NUMBER COMMUNITY_AREA_NAME  PERCENT_OF_HOUSING_CROWDED  \
0                     1         Rogers Park                         7.7
1                     2          West Ridge                         7.8
2                     3              Uptown                         3.8
3                     4      Lincoln Square                         3.4
4                     5        North Center                         0.3

   PERCENT_HOUSEHOLDS_BELOW_POVERTY  PERCENT_AGED_16__UNEMPLOYED  \
0                              23.6                          8.7
1                              17.2                          8.8
2                              24.0                          8.9
3                              10.9                          8.2
4                               7.5                          5.2

   PERCENT_AGED_25__WITHOUT_HIGH_SCHOOL_DIPLOMA  \
0                                          18.2
1                                          20.8
2                                          11.8
3                                          13.4
4                                           4.5

   PERCENT_AGED_UNDER_18_OR_OVER_64  PER_CAPITA_INCOME HARDSHIP_INDEX
0                              27.5              23939             39
1                              38.5              23040             46
2                              22.2              35787             20
3                              25.5              37524             17
4                              26.2              57123              6

C:\Users\softp\AppData\Local\Temp\ipykernel_34132\2750542660.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

<!-- Exercise 1: Using Joins
You have been asked to produce some reports about the communities and crimes in the Chicago area. You will need to use SQL join queries to access the data stored across multiple tables. -->

<!-- Question 1
Write and execute a SQL query to list the school names, community names and average attendance for communities with a hardship index of 98.
Hint 1
Use tables CHICAGO_PUBLIC_SCHOOLS and CHICAGO_SOCIO_ECONOMIC_DATA
Hint 2
Use a left join -->

In [28]:
# Setting up the connection string (replace with your actual credentials)
%sql mysql+mysqlconnector://root:admin@localhost/Mysql_learners

In [10]:
%%sql
SELECT S.NAME_OF_SCHOOL, S.COMMUNITY_AREA_NAME, S.AVERAGE_STUDENT_ATTENDANCE, S.Average_Teacher_Attendance, E.HARDSHIP_INDEX
FROM chicago_public_schools AS S
LEFT JOIN chicago_socioeconomic_data AS E
ON S.COMMUNITY_AREA_NUMBER = E.COMMUNITY_AREA_NUMBER 
LIMIT 15;

 * mysql+mysqlconnector://root:***@localhost/Mysql_learners
15 rows affected.

[('Abraham Lincoln Elementary School', 'LINCOLN PARK', '96.00%', '96.40%', '2'),
 ('Adam Clayton Powell Paideia Community Academy Elementary School', 'SOUTH SHORE', '95.60%', '95.30%', '55'),
 ('Adlai E Stevenson Elementary School', 'ASHBURN', '95.70%', '94.70%', '37'),
 ('Agustin Lara Elementary Academy', 'NEW CITY', '95.50%', '95.80%', '91'),
 ('Air Force Academy High School', 'ARMOUR SQUARE', '93.30%', '96.90%', '82'),
 ('Albany Park Multicultural Academy', 'ALBANY PARK', '97.00%', '96.90%', '53'),
 ('Albert G Lane Technical High School', 'NORTH CENTER', '96.30%', '96.20%', '6'),
 ('Albert R Sabin Elementary Magnet School', 'WEST TOWN', '94.70%', '95.00%', '10'),
 ('Alcott High School for the Humanities', 'NORTH CENTER', '92.70%', '96.90%', '6'),
 ('Alessandro Volta Elementary School', 'ALBANY PARK', '96.40%', '95.90%', '53'),
 ('Alexander Graham Bell Elementary School', 'NORTH CENTER', '96.30%', '95.90%', '6'),
 ('Alexander Graham Elementary School', 'NEW CITY', '92.50%', '95.00%', '91'),
 ('Alexander Hamilton Elementary School', 'LAKE VIEW', '95.30%', '97.40%', '5'),
 ('Alexander von Humboldt Elementary School', 'WEST TOWN', '92.50%', '96.00%', '10'),
 ('Alex Haley Elementary Academy', 'ROSELAND', '94.90%', '94.70%', '52')]

<!-- Question 2
Write and execute a SQL query to list all crimes that took place at a school. Include case number, crime type and community name.
Hint 1
Use tables CHICAGO_CRIME_DATA and CHICAGO_SOCIOECONOMIC_DATA
Hint 2
Use a left join
Hint 3
The column location_description will help you find the crime location -->

In [13]:
%%sql
SELECT C.CASE_NUMBER, C.PRIMARY_TYPE, E.COMMUNITY_AREA_NAME
FROM chicago_crime AS C
LEFT JOIN chicago_socioeconomic_data AS E
ON C.COMMUNITY_AREA_NUMBER = E.COMMUNITY_AREA_NUMBER
WHERE C.LOCATION_DESCRIPTION LIKE '%SCHOOL%'

 * mysql+mysqlconnector://root:***@localhost/Mysql_learners
12 rows affected.

[('HL353697', 'BATTERY', 'South Shore'),
 ('HL725506', 'BATTERY', 'Lincoln Square'),
 ('HP716225', 'BATTERY', 'Douglas'),
 ('HH639427', 'BATTERY', 'Austin'),
 ('JA460432', 'BATTERY', 'Ashburn'),
 ('HS200939', 'CRIMINAL DAMAGE', 'Austin'),
 ('HK577020', 'NARCOTICS', 'Rogers Park'),
 ('HS305355', 'NARCOTICS', 'Brighton Park'),
 ('HT315369', 'ASSAULT', 'East Garfield Park'),
 ('HR585012', 'CRIMINAL TRESPASS', 'Ashburn'),
 ('HH292682', 'PUBLIC PEACE VIOLATION', 'CHICAGO'),
 ('G635735', 'PUBLIC PEACE VIOLATION', 'CHICAGO')]

<!-- Exercise 2: Creating a View
For privacy reasons, you have been asked to create a view that enables users to select just the school name and the icon fields from the CHICAGO_PUBLIC_SCHOOLS table. By providing a view, you can ensure that users cannot see the actual scores given to a school, just the icon associated with their score. You should define new names for the view columns to obscure the use of scores and icons in the original table.

Question 1
Write and execute a SQL statement to create a view showing the columns listed in the following table, with new column names as shown in the second column. -->

In [14]:
%%sql
CREATE VIEW chicago_school_view AS
SELECT
    NAME_OF_SCHOOL AS School_Name,
    Safety_Icon AS Safety_Rating,
    Family_Involvement_Icon AS Family_Rating,
    Environment_Icon AS Environment_Rating,
    Instruction_Icon AS Instruction_Rating,
    Leaders_Icon AS Leaders_Rating,
    Teachers_Icon AS Teachers_Rating
FROM chicago_public_schools;

 * mysql+mysqlconnector://root:***@localhost/Mysql_learners
0 rows affected.

[]

 <!-- Write and execute a SQL statement that returns all of the columns from the view. -->

In [17]:
%%sql
SELECT * 
FROM chicago_school_view 
LIMIT 5;

 * mysql+mysqlconnector://root:***@localhost/Mysql_learners
5 rows affected.

[('Abraham Lincoln Elementary School', 'Very Strong', 'Very Strong', 'Strong', 'Strong', 'Weak', 'Strong'),
 ('Adam Clayton Powell Paideia Community Academy Elementary School', 'Average', 'Strong', 'Strong', 'Very Strong', 'Weak', 'Strong'),
 ('Adlai E Stevenson Elementary School', 'Strong', 'NDA', 'Average', 'Weak', 'Weak', 'NDA'),
 ('Agustin Lara Elementary Academy', 'Average', 'Average', 'Average', 'Weak', 'Weak', 'Average'),
 ('Air Force Academy High School', 'Average', 'Strong', 'Strong', 'Average', 'Weak', 'Average')]

<!-- Write and execute a SQL statement that returns just the school name and leaders rating from the view. -->

In [19]:
%%sql
SELECT School_Name, Leaders_Rating
FROM chicago_school_view
LIMIT 5;

 * mysql+mysqlconnector://root:***@localhost/Mysql_learners
5 rows affected.

[('Abraham Lincoln Elementary School', 'Weak'),
 ('Adam Clayton Powell Paideia Community Academy Elementary School', 'Weak'),
 ('Adlai E Stevenson Elementary School', 'Weak'),
 ('Agustin Lara Elementary Academy', 'Weak'),
 ('Air Force Academy High School', 'Weak')]

<!-- Exercise 3: Creating a Stored Procedure
The icon fields are calculated based on the value in the corresponding score field. You need to make sure that when a score field is updated, the icon field is updated too. To do this, you will write a stored procedure that receives the school id and a leaders score as input parameters, calculates the icon setting and updates the fields appropriately.

Question 1
Write the structure of a query to create or replace a stored procedure called UPDATE_LEADERS_SCORE that takes a in_School_ID parameter as an integer and a in_Leader_Score parameter as an integer. -->

In [21]:
%%sql
DELIMITER //

CREATE PROCEDURE UPDATE_LEADERS_SCORE(
    IN in_School_ID INT,
    IN in_Leader_Score INT
)
BEGIN
    -- Procedure logic will go here
END //

DELIMITER ;

 * mysql+mysqlconnector://root:***@localhost/Mysql_learners
0 rows affected.

[]

<!-- Question 2
Inside your stored procedure, write a SQL statement to update the Leaders_Score field in the CHICAGO_PUBLIC_SCHOOLS table for the school identified by in_School_ID to the value in the in_Leader_Score parameter. -->

In [ ]:
%%sql
DELIMITER //

DROP PROCEDURE IF EXISTS UPDATE_LEADERS_SCORE //

CREATE PROCEDURE UPDATE_LEADERS_SCORE(
    IN in_School_ID INT,
    IN in_Leader_Score INT
)
BEGIN
    -- update Leader_Score field
    UPDATE chicago_public_schools
    SET Leaders_Score = in_Leader_Score
    WHERE School_ID = in_School_ID;
END //

DELIMITER ;

 * mysql+mysqlconnector://root:***@localhost/Mysql_learners
0 rows affected.

[]

<!-- Question 3
Inside your stored procedure, write a SQL IF statement to update the Leaders_Icon field in the CHICAGO_PUBLIC_SCHOOLS table for the school identified by in_School_ID using the following information. -->

In [24]:
%%sql
DELIMITER //

DROP PROCEDURE IF EXISTS UPDATE_LEADERS_SCORE //

CREATE PROCEDURE UPDATE_LEADERS_SCORE(
    IN in_School_ID INT,
    IN in_Leader_Score INT
)
BEGIN

IF in_Leader_Score >= 0 AND in_Leader_Score < 20 THEN
    UPDATE chicago_public_schools
    SET Leaders_Icon = 'Very weak'
    WHERE School_ID = in_School_ID;
ELSEIF in_Leader_Score >= 20 AND in_Leader_Score < 40 THEN
    UPDATE chicago_public_schools
    SET Leaders_Icon = 'Weak'
    WHERE School_ID = in_School_ID;
ELSEIF in_Leader_Score >= 40 AND in_Leader_Score < 60 THEN
    UPDATE chicago_public_schools
    SET Leaders_Icon = 'Average'
    WHERE School_ID = in_School_ID;
ELSEIF in_Leader_Score >= 60 AND in_Leader_Score < 80 THEN
    UPDATE chicago_public_schools
    SET Leaders_Icon = 'Strong'
    WHERE School_ID = in_School_ID;
ELSEIF in_Leader_Score >= 80 AND in_Leader_Score < 100 THEN
    UPDATE chicago_public_schools
    SET Leaders_Icon = 'Very strong'
    WHERE School_ID = in_School_ID;
END IF;

END //

DELIMITER ;

 * mysql+mysqlconnector://root:***@localhost/Mysql_learners
0 rows affected.

[]

<!-- Question 4
Run your code to create the stored procedure. 
Write a query to call the stored procedure, passing a valid school ID and a leader score of 50, to check that the procedure works as expected. -->

In [29]:
%%sql
-- Call the procedure 
CALL UPDATE_LEADERS_SCORE(610281, 50);

-- Verify the update
SELECT School_ID, Leaders_Score, Leaders_Icon 
FROM chicago_public_schools 
WHERE School_ID = 610281;

 * mysql+mysqlconnector://root:***@localhost/Mysql_learners
1 rows affected.
1 rows affected.

[(610281, '63', 'Average')]

<!-- Exercise 4: Using Transactions
You realise that if someone calls your code with a score outside of the allowed range (0-99), then the score will be updated with the invalid data and the icon will remain at its previous value. There are various ways to avoid this problem, one of which is using a transaction.

Question 1
Update your stored procedure definition. Add a generic ELSE clause to the IF statement that rolls back the current work if the score did not fit any of the preceding categories.
Hint 1
You can add an ELSE clause to the IF statement which will only run if none of the previous conditions have been met. -->

In [30]:
%%sql
DELIMITER //

DROP PROCEDURE IF EXISTS UPDATE_LEADERS_SCORE //

CREATE PROCEDURE UPDATE_LEADERS_SCORE(
    IN in_School_ID INT,
    IN in_Leader_Score INT
)
BEGIN

 -- Start the transaction
    START TRANSACTION;

IF in_Leader_Score >= 0 AND in_Leader_Score < 20 THEN
    UPDATE chicago_public_schools
    SET Leaders_Icon = 'Very weak'
    WHERE School_ID = in_School_ID;
ELSEIF in_Leader_Score >= 20 AND in_Leader_Score < 40 THEN
    UPDATE chicago_public_schools
    SET Leaders_Icon = 'Weak'
    WHERE School_ID = in_School_ID;
ELSEIF in_Leader_Score >= 40 AND in_Leader_Score < 60 THEN
    UPDATE chicago_public_schools
    SET Leaders_Icon = 'Average'
    WHERE School_ID = in_School_ID;
ELSEIF in_Leader_Score >= 60 AND in_Leader_Score < 80 THEN
    UPDATE chicago_public_schools
    SET Leaders_Icon = 'Strong'
    WHERE School_ID = in_School_ID;
ELSEIF in_Leader_Score >= 80 AND in_Leader_Score < 100 THEN
    UPDATE chicago_public_schools
    SET Leaders_Icon = 'Very strong'
    WHERE School_ID = in_School_ID;
ELSE
    -- Rollback if the score is out of range
    ROLLBACK;
    SIGNAL SQLSTATE '45000'
        SET MESSAGE_TEXT = 'Invalid Leader Score. The score must be between 0 and 99.';
END IF;

END //

DELIMITER ;

 * mysql+mysqlconnector://root:***@localhost/Mysql_learners
0 rows affected.

[]

<!-- Question 2
Update your stored procedure definition again. Add a statement to commit the current unit of work at the end of the procedure.
Hint 1
Remember that as soon as any code inside the IF/ELSE IF/ELSE statements completes, processing resumes after the END IF, so you can add your commit code there. -->

In [31]:
%%sql
DELIMITER //

DROP PROCEDURE IF EXISTS UPDATE_LEADERS_SCORE //

CREATE PROCEDURE UPDATE_LEADERS_SCORE(
    IN in_School_ID INT,
    IN in_Leader_Score INT
)
BEGIN

 -- Start the transaction
    START TRANSACTION;

IF in_Leader_Score >= 0 AND in_Leader_Score < 20 THEN
    UPDATE chicago_public_schools
    SET Leaders_Icon = 'Very weak'
    WHERE School_ID = in_School_ID;
ELSEIF in_Leader_Score >= 20 AND in_Leader_Score < 40 THEN
    UPDATE chicago_public_schools
    SET Leaders_Icon = 'Weak'
    WHERE School_ID = in_School_ID;
ELSEIF in_Leader_Score >= 40 AND in_Leader_Score < 60 THEN
    UPDATE chicago_public_schools
    SET Leaders_Icon = 'Average'
    WHERE School_ID = in_School_ID;
ELSEIF in_Leader_Score >= 60 AND in_Leader_Score < 80 THEN
    UPDATE chicago_public_schools
    SET Leaders_Icon = 'Strong'
    WHERE School_ID = in_School_ID;
ELSEIF in_Leader_Score >= 80 AND in_Leader_Score < 100 THEN
    UPDATE chicago_public_schools
    SET Leaders_Icon = 'Very strong'
    WHERE School_ID = in_School_ID;
ELSE
    -- Rollback if the score is out of range
    ROLLBACK;
    SIGNAL SQLSTATE '45000'
        SET MESSAGE_TEXT = 'Invalid Leader Score. The score must be between 0 and 99.';
END IF;

-- Commit the transaction
COMMIT;

END //

DELIMITER ;

 * mysql+mysqlconnector://root:***@localhost/Mysql_learners
0 rows affected.

[]

<!-- Write and run one query to check that the updated stored procedure works as expected when you use a valid score of 38. -->

In [ ]:
%%sql
-- Call the procedure 
CALL UPDATE_LEADERS_SCORE(610281, 38);

-- Verify the update
SELECT School_ID, Leaders_Score, Leaders_Icon 
FROM chicago_public_schools 
WHERE School_ID = 610281;

<!-- Write and run another query to check that the updated stored procedure works as expected when you use an invalid score of 101. -->

In [ ]:
%%sql
-- Call the procedure 
CALL UPDATE_LEADERS_SCORE(610281, 101);

-- Verify the update
SELECT School_ID, Leaders_Score, Leaders_Icon 
FROM chicago_public_schools 
WHERE School_ID = 610281;